<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Login</title>
    <link rel="stylesheet" href="style.css">
</head>

<body>
    <header>
        <?php include 'navigation.php'; session_start(); ?>
        
    </header>
    <div class="container">
        <form action="login_process.php" method="POST" class="login-form">
            <h2>Σύνδεση</h2>
            <?php if (isset($_SESSION["error"])): ?>
                <div class="error"><?php echo $_SESSION["error"]; ?></div>
                <?php unset($_SESSION["error"]); ?>
            <?php endif; ?>
            <div class="form-group">
                <label for="username">Όνομα Χρήστη:</label>
                <input type="text" id="username" name="username" required>
            </div>
            <div class="form-group">
                <label for="password">Κωδικός:</label>
                <input type="password" id="password" name="password" required>
            </div>
            <button type="submit">Σύνδεση</button>
            <br>
        </form>
    </div>
   
    <br><br>


    <br><br>

    <div style='background-color: #DADDB1; color: black;'>

    <div style="display: flex; justify-content: space-between; padding: 20px; background-color: #DADDB1;">
            <div>
              <p>Η είσοδος στο κατάστημά μας προσφέρει αρκετά σημαντικά πλεονεκτήματα για τους πελάτες που ενδιαφέρονται για κινητούς υπολογιστές και κάμερες. Πρώτον, οι εγγεγραμμένοι χρήστες έχουν πρόσβαση σε προσφορές και εκπτώσεις που δεν είναι διαθέσιμες σε τυχαίους επισκέπτες της ιστοσελίδας. Αυτό σημαίνει ότι μπορείτε να αποκτήσετε τα τελευταία μοντέλα κινητών υπολογιστών και κάμερων σε τιμές που συχνά είναι σημαντικά χαμηλότερες από τον ανταγωνισμό. 
                Η εγγραφή σας δίνει επίσης τη δυνατότητα να λαμβάνετε ειδοποιήσεις για τα τελευταία προϊόντα και προσφορές που ταιριάζουν στις προτιμήσεις και τις ανάγκες σας.</p>
            </div>
            <div>
               <p>Δεύτερον, η δημιουργία ενός λογαριασμού εξασφαλίζει μια πιο προσωποποιημένη εμπειρία ψωνίων. Μέσω του λογαριασμού σας, το σύστημά μας μπορεί να παρακολουθεί τις προηγούμενες αγορές σας και να σας προτείνει παρόμοια προϊόντα που ενδεχομένως σας ενδιαφέρουν. Αυτό κάνει τη διαδικασία αναζήτησης πιο γρήγορη και αποδοτική, καθώς είναι προσαρμοσμένη στις συγκεκριμένες τεχνολογικές σας ανάγκες και προτιμήσεις. 
                Επιπλέον, οι αποθηκευμένες ρυθμίσεις και προτιμήσεις σας μπορούν να διευκολύνουν την επαναλαμβανόμενη αγορά αξεσουάρ ή αναβαθμίσεων για τα προϊόντα που έχετε ήδη αγοράσει.</p>
            </div>
            <div>
               
                <p>Τρίτον, με το να κάνετε login στο κατάστημά μας, αποκτάτε πρόσβαση σε υπηρεσίες μετά την πώληση και υποστήριξη πελατών. Οι εγγεγραμμένοι χρήστες έχουν τη δυνατότητα να καταγράφουν και να παρακολουθούν εύκολα τις εγγυήσεις των προϊόντων τους, να προγραμματίζουν επισκευές 
                    ή συντηρήσεις και να λαμβάνουν γρήγορα βοήθεια μέσω της απευθείας γραμμής επικοινωνίας με το τμήμα εξυπηρέτησης πελατών. Αυτή η υποστήριξη είναι ζωτικής σημασίας για τη διατήρηση της αποδοτικότητας και της λειτουργικότητας των τεχνολογικών σας επενδύσεων, εξασφαλίζοντας ότι επωφελείστε πλήρως από κάθε αγορά.</p>
            </div>
        </div>

            </div>

    <footer style='background-color: #BFB29E; color: black;'>
        <div style="display: flex; justify-content: space-between; padding: 20px; background-color: #BFB29E;">
            <div>
                <h3>Διεύθυνση</h3>
                <p>Οδός Εξαμπλωμάτων 5, Αθήνα, 11521</p>
            </div>
            <div>
                <h3>Επικοινωνία</h3>
                <p>Σταθερό: 210 1234567</p>
                <p>Κινητό: 690 1234567</p>
                <p>Email: info@techshop.gr</p>
            </div>
            <div>
                <h3>Πληροφορίες</h3>
                <p>Όλα τα προϊόντα μας συνοδεύονται από γραπτή εγγύηση ποιότητας.</p>
                <p>Διαθέτουμε μια ευρεία ποικιλία σε κινητούς υπολογιστές και φωτογραφικές μηχανές.</p>
            </div>
        </div>
        <p style="text-align: center;">&copy; 2024 Μυρσίνη Κάμπα. Όλα τα δικαιώματα επιφυλασσόμενα.</p>
        <br> <br>
    </footer>

</body>

</html>
